Revit 2027 API
ApplicationEntryPoint.GetRibbonPanels(Tab) Method
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override List<RibbonPanel> GetRibbonPanels(
	Tab tab
)
Public Overrides Function GetRibbonPanels (
	tab As Tab
) As List(Of RibbonPanel)
public:
virtual List<RibbonPanel^>^ GetRibbonPanels(
	Tab tab
) override
abstract GetRibbonPanels :
        tab : Tab -> List<RibbonPanel>
override GetRibbonPanels :
        tab : Tab -> List<RibbonPanel>
Parameters
tab Tab
Return Value
List<RibbonPanel>
See Also
Reference
ApplicationEntryPoint Class
GetRibbonPanels Overload
Autodesk.Revit.UI.Macros Namespace